/*Подсчитайте количество дней рождения, которые приходятся на каждый из дней недели. Следует учесть, что необходимы дни недели текущего года, а не года рождения.*/
mysql> SELECT * FROM users;
+----+--------------------+-------------+---------------------+---------------------+
| id | name               | birthday_at | created_at          | updated_at          |
+----+--------------------+-------------+---------------------+---------------------+
|  1 | Геннадий           | 1990-10-05  | 2020-12-14 21:57:49 | 2020-12-14 21:57:49 |
|  2 | Наталья            | 1984-11-12  | 2020-12-14 21:57:49 | 2020-12-14 21:57:49 |
|  3 | Александр          | 1985-05-20  | 2020-12-14 21:57:49 | 2020-12-14 21:57:49 |
|  4 | Сергей             | 1988-02-14  | 2020-12-14 21:57:49 | 2020-12-14 21:57:49 |
|  5 | Иван               | 1998-01-12  | 2020-12-14 21:57:49 | 2020-12-14 21:57:49 |
|  6 | Мария              | 1992-08-29  | 2020-12-14 21:57:49 | 2020-12-14 21:57:49 |
+----+--------------------+-------------+---------------------+---------------------+
6 rows in set (0.00 sec)

/*день недели года рождения*/

mysql> SELECT DAYNAME(birthday_at) AS birthday_at FROM users;
+-------------+
| birthday_at |
+-------------+
| Friday      |
| Monday      |
| Monday      |
| Sunday      |
| Monday      |
| Saturday    |
+-------------+
6 rows in set (0.00 sec)
mysql> SELECT COUNT(*), DAYNAME(birthday_at) AS days FROM users GROUP BY days;
+----------+----------+
| COUNT(*) | days     |
+----------+----------+
|        1 | Friday   |
|        3 | Monday   |
|        1 | Sunday   |
|        1 | Saturday |
+----------+----------+
4 rows in set (0.00 sec)

/*дни недели текущего и следующего года*/

mysql> SELECT COUNT(*), DAYNAME(DATE_FORMAT(birthday_at, '2020-%m-%d')) AS days FROM users GROUP BY days;
+----------+-----------+
| COUNT(*) | days      |
+----------+-----------+
|        1 | Monday    |
|        1 | Thursday  |
|        1 | Wednesday |
|        1 | Friday    |
|        1 | Sunday    |
|        1 | Saturday  |
+----------+-----------+
6 rows in set (0.00 sec)

mysql> SELECT COUNT(*), DAYNAME(DATE_FORMAT(birthday_at, '2021-%m-%d')) AS days FROM users GROUP BY days;
+----------+----------+
| COUNT(*) | days     |
+----------+----------+
|        2 | Tuesday  |
|        1 | Friday   |
|        1 | Thursday |
|        2 | Sunday   |
+----------+----------+
4 rows in set (0.01 sec)


