/*Таблица users была неудачно спроектирована. Записи created_at и updated_at были заданы типом VARCHAR и в них долгое время помещались значения в формате 20.10.2017 8:10. Необходимо преобразовать поля к типу DATETIME, сохранив введённые ранее значения.*/

mysql> SELECT * FROM users;
+----+--------------------+-------------+-----------------+-----------------+
| id | name               | birthday_at | created_at      | updated_at      |
+----+--------------------+-------------+-----------------+-----------------+
|  1 | Геннадий           | 1990-10-05  | 20.10.2017 8:10 | 20.10.2017 8:10 |
|  2 | Наталья            | 1984-11-12  | 20.10.2017 8:10 | 20.10.2017 8:10 |
|  3 | Александр          | 1985-05-20  | 20.10.2017 8:10 | 20.10.2017 8:10 |
|  4 | Сергей             | 1988-02-14  | 20.10.2017 8:10 | 20.10.2017 8:10 |
|  5 | Иван               | 1998-01-12  | 20.10.2017 8:10 | 20.10.2017 8:10 |
|  6 | Мария              | 1992-08-29  | 20.10.2017 8:10 | 20.10.2017 8:10 |
|  7 | Александр          | 1940-01-01  | 20.10.2017 8:10 | 20.10.2017 8:10 |
+----+--------------------+-------------+-----------------+-----------------+
7 rows in set (0.00 sec)
mysql> describe users;
+-------------+-----------------+------+-----+---------+----------------+
| Field       | Type            | Null | Key | Default | Extra          |
+-------------+-----------------+------+-----+---------+----------------+
| id          | bigint unsigned | NO   | PRI | NULL    | auto_increment |
| name        | varchar(255)    | YES  |     | NULL    |                |
| birthday_at | date            | YES  |     | NULL    |                |
| created_at  | varchar(25)     | YES  |     | NULL    |                |
| updated_at  | varchar(25)     | YES  |     | NULL    |                |
+-------------+-----------------+------+-----+---------+----------------+
5 rows in set (0.01 sec)

mysql> UPDATE users SET created_at = STR_TO_DATE(created_at, '%d.%m.%Y %h:%i'), updated_at =  STR_TO_DATE(updated_at, '%d.%m.%Y %h:%i');
Query OK, 7 rows affected (0.00 sec)
Rows matched: 7  Changed: 7  Warnings: 0

mysql> SELECT * FROM users;
+----+--------------------+-------------+---------------------+---------------------+
| id | name               | birthday_at | created_at          | updated_at          |
+----+--------------------+-------------+---------------------+---------------------+
|  1 | Геннадий           | 1990-10-05  | 2017-10-20 08:10:00 | 2017-10-20 08:10:00 |
|  2 | Наталья            | 1984-11-12  | 2017-10-20 08:10:00 | 2017-10-20 08:10:00 |
|  3 | Александр          | 1985-05-20  | 2017-10-20 08:10:00 | 2017-10-20 08:10:00 |
|  4 | Сергей             | 1988-02-14  | 2017-10-20 08:10:00 | 2017-10-20 08:10:00 |
|  5 | Иван               | 1998-01-12  | 2017-10-20 08:10:00 | 2017-10-20 08:10:00 |
|  6 | Мария              | 1992-08-29  | 2017-10-20 08:10:00 | 2017-10-20 08:10:00 |
|  7 | Александр          | 1940-01-01  | 2017-10-20 08:10:00 | 2017-10-20 08:10:00 |
+----+--------------------+-------------+---------------------+---------------------+
7 rows in set (0.00 sec)
mysql> ALTER TABLE users MODIFY created_at DATETIME;
Query OK, 7 rows affected (0.17 sec)
Records: 7  Duplicates: 0  Warnings: 0

mysql> ALTER TABLE users MODIFY updated_at DATETIME;
Query OK, 7 rows affected (0.06 sec)
Records: 7  Duplicates: 0  Warnings: 0

mysql> describe users;
+-------------+-----------------+------+-----+---------+----------------+
| Field       | Type            | Null | Key | Default | Extra          |
+-------------+-----------------+------+-----+---------+----------------+
| id          | bigint unsigned | NO   | PRI | NULL    | auto_increment |
| name        | varchar(255)    | YES  |     | NULL    |                |
| birthday_at | date            | YES  |     | NULL    |                |
| created_at  | datetime        | YES  |     | NULL    |                |
| updated_at  | datetime        | YES  |     | NULL    |                |
+-------------+-----------------+------+-----+---------+----------------+
5 rows in set (0.01 sec)


